lucca-pellegrini/libcounter/sdkconfig.defaults
# ESP32-S3 Configuration
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# ESP32-S3 N16R8 configuration
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Flash size (16MB)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# Enable FreeRTOS stats for better debugging
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y

# Debug logging (temporarily verbose)
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# Internal RGB LED (NeoPixel/WS2812) data line on GPIO48
CONFIG_RGB_LED_GPIO=48

# Button long-press threshold in ms (short press = reset confirm, long press = manual save)
CONFIG_BUTTON_LONG_PRESS_MS=500

# Debug mode counter value (used when booting with the button held)
CONFIG_DEBUG_COUNT=93707

# Interval between NVS saves, in seconds (default 5 minutes; min 60, max 21600)
CONFIG_NVS_SAVE_INTERVAL_SECONDS=300